In [1]:
import pandas as pd

In [5]:
df = pd.read_csv("tom_test2.csv")

In [9]:
print(df.size)

271458

In [10]:
df.head()

,sex,age,race,marital-status,education,native-country,workclass,occupation,salary-class
0,*,30-39,*,spouse not present,*,*,*,Other,*
1,*,40-49,*,spouse present,*,*,*,Nontechnical,*
2,*,30-39,*,spouse not present,*,*,*,Nontechnical,*
3,*,50-59,*,spouse present,*,*,*,Nontechnical,*
4,*,20-29,*,spouse present,*,*,*,Technical,*